import React from 'react';


// export function Article({
//   fontSize
// }) {
//   return <p className='text-black dark:text-white' style={{
//     fontSize: `${fontSize}px`
//   }}>ক্লাউড কম্পিউটিং আমাদের জীবনযাত্রাকে প্রতিনিয়ত এগিয়ে নিচ্ছে। ডিজিটালাইজেশনের যুগে সবচেয়ে গুরুত্বপূর্ণ উপাদান তথ্য, অর্থাৎ ডেটা। যোগাযোগ, কর্মক্ষেত্র, পড়াশোনা, অবসরসহ নিত্যদিনের যেকোনো কাজের পুরোটাই নির্ভর করে আছে এই তথ্যের উপর। তো এই বিশাল পরিমাণ তথ্যের ঠিকানা কোথায়? কোথায় গিয়ে জমা হচ্ছে আমাদের জীবনের খুঁটিনাটি? উত্তর- ডেটা সেন্টার। বিশালাকার জায়গা জুড়ে শত শত সার্ভার নিয়ে তৈরি করা হয় একটি ডেটা সেন্টার। কিন্তু যে হারে তথ্যের সংখ্যা বেড়ে চলছে, এগুলোকে রক্ষণাবেক্ষণ করাও ততটা কঠিন হয়ে পড়ছে।

// এজন্য ডেটা রক্ষণাবেক্ষণ ও প্রক্রিয়া সহজতর করে তুলতে মাইক্রোসফট ২০১৮ সালে এক অভিনব সিদ্ধান্ত গ্রহণ করে। যে সিদ্ধান্ত হয়তো ভবিষ্যতের ডেটা স্টোরেজ সিস্টেমই পাল্টে দেয়ার ক্ষমতা রাখে। মাইক্রোসফটের এই পদক্ষেপ যেমন ব্যতিক্রম, তেমনি তাদের সফলতা ডেটা সেন্টারের চিন্তাধারায় অপার সম্ভাবনার মাত্রা যুক্ত করেছে। চলুন জানা যাক মাইক্রোসফটের আন্ডারওয়াটার ডেটা সেন্টারের গল্প!
//   </p>;
// }
//   export default Article;


export function Article(props) {


  return <div className=''>
     <div className='relative text-black dark:text-white ImgSpace' dangerouslySetInnerHTML={{ __html: props.content }}> 
  
  </div>
  
  </div>;
}
  export default Article;